ZigEmbeddedGroup/texasinstruments-data/ccs_base/common/targetdb/Modules/AM263X/ICSSM_ICSSM_PR1_ICSSS_UART_UART_SLV_48028000h.xml
	<bitfield id="FREE" width="1" begin="0" end="0" resetval="0x0" description="Free-running enable mode bit. This bit determines the emulation mode functionality of the UART. When halted, the UART can handle register read/write requests, but does not generate any transmission/reception, interrupts or events. 0      If a transmission is not in progress, the       UART halts immediately. If a transmission       is in progress, the UART halts after       completion of the one-word transmission.1      Free-running mode is enabled; UART       continues to run normally." range="0" rwaccess="R/W"/>
	</register><register id="ICSSM_PR1_ICSSS_UART_UART_SLV_MDR" acronym="ICSSM_PR1_ICSSS_UART_UART_SLV_MDR" offset="52" width="32" description="UART Mode Definition Register.">
		<bitfield id="OSM_SEL" width="1" begin="0" end="0" resetval="0x0" description="Over-Sampling Mode Select 0      16x over-sampling1      13x over-sampling" range="0" rwaccess="R/W"/>
	</register><register id="ICSSM_PR1_ICSSS_UART_UART_SLV_THR" acronym="ICSSM_PR1_ICSSS_UART_UART_SLV_THR" offset="0" width="32" description="The transmitter holding register (THR) (write only)The UART transmitter section consists of a transmitter hold register (THR) and a transmitter shift register (TSR). When the UART is in the FIFO mode, THR is a 16-byte FIFO. Transmitter section control is a function of the line control register (LCR).THR receives data from the internal data bus and when TSR is idle, the UART moves the data from THR to TSR. The UART serializes the data in TSR and transmits the data on the TX pin. In the non-FIFO mode, if THR is empty and the THR empty (THRE) interrupt is enabled (ETBEI = 1 in IER), an interrupt is generated. This interrupt is cleared when a character is loaded into THR or the interrupt identification register (IIR) is read. In the FIFO mode, the interrupt is generated when the transmitter FIFO is empty, and it is cleared when at least one byte is loaded into the FIFO or IIR is read.">
		<bitfield id="DATA" width="8" begin="7" end="0" resetval="0x0" description="Data to transmit" range="7:0" rwaccess="W"/>
	</register><register id="ICSSM_PR1_ICSSS_UART_UART_SLV_FCR" acronym="ICSSM_PR1_ICSSS_UART_UART_SLV_FCR" offset="8" width="32" description="FIFO Control Register (write only)The FIFO control register (FCR) is a write-only register at the same address as the interrupt identification register (IIR), which is a read-only register.">
		<bitfield id="RXFITL" width="2" begin="7" end="6" resetval="0x0" description="Receiver FIFO trigger level.RXFIFTL sets the trigger level for the receiver FIFO.When the trigger level is reached, a receiver data-ready interrupt is generated (if the interrupt request is enabled).Once the FIFO drops below the trigger level, the interrupt is cleared. 0h     1 byte1h     4 bytes2h     8 bytes3h     14 bytes" range="7:6" rwaccess="W"/>
	<bitfield id="DMAMODE1" width="1" begin="3" end="3" resetval="0x1" description="DMA MODE1 enable if FIFOs are enabled.Always write 1 to DMAMODE1.After a hardware reset, change DMAMODE1 from 0 to 1.DMAMODE1 = 1 is a requirement for proper communication between the UART and the EDMA controller. 0h     DMA MODE 1 is disabled1h     DMA MODE 1 is enabled" range="3" rwaccess="W"/>
	<bitfield id="TXCLR" width="1" begin="2" end="2" resetval="0x0" description="Transmitter FIFO clear. Write a 1 to TXCLR to clear the bit. 0h     No effect1h     Clears transmitter FIFO and resets the       transmitter FIFO counter.  The shift       register is not cleared." range="2" rwaccess="W"/>
	<bitfield id="RXCLR" width="1" begin="1" end="1" resetval="0x0" description="Receiver FIFO clear. Write a 1 to RXCLR to clear the bit. 0h     No effect1h     Clears receiver FIFO and resets the       receiver FIFO counter.  The shift register       is not cleared." range="1" rwaccess="W"/>
	<bitfield id="FIFOEN" width="1" begin="0" end="0" resetval="0x0" description="Transmitter and receiver FIFOs mode enable. FIFOEN must be set before other FCR bits are written to or the FCR bits are not programmed. Clearing this bit clears the FIFO counters. 0h     Non-FIFO mode. The transmitter and receiver       FIFOs are disabled, and the FIFO pointers       are cleared.1h     FIFO mode. The transmitter and receiver       FIFOs are enabled." range="0" rwaccess="W"/>
	</register><register id="ICSSM_PR1_ICSSS_UART_UART_SLV_REVID2" acronym="ICSSM_PR1_ICSSS_UART_UART_SLV_REVID2" offset="44" width="32" description="Revision Identification Register 2">
		<bitfield id="REVID2" width="8" begin="7" end="0" resetval="0x0" description="Peripheral Identification Number" range="7:0" rwaccess="R"/>
	</register>
</module>